sbin/dmesg/dmesg.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     @(#)dmesg.8	8.1 (Berkeley) 6/5/93
.\"
.Dd 
.Dt DMESG 8
.Os BSD 4
.Sh NAME
.Nm dmesg
.Nd "display the system message buffer"
.Sh SYNOPSIS
.Nm dmesg
.Op Fl M Ar core
.Op Fl N Ar system
.Sh DESCRIPTION
.Nm Dmesg
displays the contents of the system message buffer.
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl M
Extract values associated with the name list from the specified core
instead of the default ``/dev/kmem''.
.It Fl N
Extract the name list from the specified system instead of the default
``/vmunix''.
.El
.Sh SEE ALSO
.Xr syslogd 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
